bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/XMEGA/ATXMEGA64A4U.xml
                <instance name="HIRESD">
                    <register-group address-space="data" offset="0x990" name-in-module="HIRES" name="HIRESD"/>
                </instance>
                <instance name="HIRESE">
                    <register-group address-space="data" offset="0xA90" name-in-module="HIRES" name="HIRESE"/>
                </instance>
            </module>
            <module name="USART" id="I6090" version="XMEGAAU">
                <instance name="USARTC0">
                    <register-group address-space="data" offset="0x8A0" name-in-module="USART" name="USARTC0"/>
                    <signals>
                        <signal field="USART0" function="USART" group="XCK" pad="PC1"/>
                        <signal field="USART0" function="USART" group="RXD" pad="PC2"/>
                        <signal field="USART0" function="USART" group="TXD" pad="PC3"/>
                        <signal field="USART0" function="USART_ALT" group="XCK" pad="PC5"/>
                        <signal field="USART0" function="USART_ALT" group="RXD" pad="PC6"/>
                        <signal field="USART0" function="USART_ALT" group="TXD" pad="PC7"/>
                    </signals>
                </instance>
                <instance name="USARTC1">
                    <register-group address-space="data" offset="0x8B0" name-in-module="USART" name="USARTC1"/>
                    <signals>
                        <signal function="USART" group="XCK" pad="PD5"/>
                        <signal function="USART" group="RXD" pad="PD6"/>
                        <signal function="USART" group="TXD" pad="PD7"/>
                    </signals>
                </instance>
                <instance name="USARTD0">
                    <register-group address-space="data" offset="0x9A0" name-in-module="USART" name="USARTD0"/>
                    <signals>
                        <signal field="USART0" function="USART" group="XCK" pad="PD1"/>
                        <signal field="USART0" function="USART" group="RXD" pad="PD2"/>
                        <signal field="USART0" function="USART" group="TXD" pad="PD3"/>
                        <signal field="USART0" function="USART_ALT" group="XCK" pad="PD5"/>
                        <signal field="USART0" function="USART_ALT" group="RXD" pad="PD6"/>
                        <signal field="USART0" function="USART_ALT" group="TXD" pad="PD7"/>
                    </signals>
                </instance>
                <instance name="USARTD1">
                    <register-group address-space="data" offset="0x9B0" name-in-module="USART" name="USARTD1"/>
                    <signals>
                        <signal function="USART" group="XCK" pad="PD5"/>
                        <signal function="USART" group="RXD" pad="PD6"/>
                        <signal function="USART" group="TXD" pad="PD7"/>
                    </signals>
                </instance>
                <instance name="USARTE0">
                    <register-group address-space="data" offset="0xAA0" name-in-module="USART" name="USARTE0"/>
                    <signals>
                        <signal function="USART" group="XCK" pad="PE1"/>
                        <signal function="USART" group="RXD" pad="PE2"/>
                        <signal function="USART" group="TXD" pad="PE3"/>
                    </signals>
                </instance>
            </module>
            <module name="SPI" id="I6090" version="XMEGAAU">
                <instance name="SPIC">
                    <register-group address-space="data" offset="0x8C0" name-in-module="SPI" name="SPIC"/>
                    <signals>
                        <signal field="SPI" function="SPI" group="SS" pad="PC4"/>
                        <signal field="SPI" function="SPI" group="MOSI" pad="PC5"/>
                        <signal field="SPI" function="SPI" group="MISO" pad="PC6"/>
                        <signal field="SPI" function="SPI" group="SCK" pad="PC7"/>
                        <signal field="SPI" function="SPI_ALT" group="SS" pad="PC4"/>
                        <signal field="SPI" function="SPI_ALT" group="SCK" pad="PC5"/>
                        <signal field="SPI" function="SPI_ALT" group="MISO" pad="PC6"/>
                        <signal field="SPI" function="SPI_ALT" group="MOSI" pad="PC7"/>
                    </signals>
                </instance>
                <instance name="SPID">
                    <register-group address-space="data" offset="0x9C0" name-in-module="SPI" name="SPID"/>
                    <signals>
                        <signal field="SPI" function="SPI" group="SS" pad="PD4"/>
                        <signal field="SPI" function="SPI" group="MOSI" pad="PD5"/>
                        <signal field="SPI" function="SPI" group="MISO" pad="PD6"/>
                        <signal field="SPI" function="SPI" group="SCK" pad="PD7"/>
                        <signal field="SPI" function="SPI_ALT" group="SS" pad="PD4"/>
                        <signal field="SPI" function="SPI_ALT" group="SCK" pad="PD5"/>
                        <signal field="SPI" function="SPI_ALT" group="MISO" pad="PD6"/>
                        <signal field="SPI" function="SPI_ALT" group="MOSI" pad="PD7"/>
                    </signals>
                </instance>
            </module>
            <module name="IRCOM" id="I6090" version="XMEGAAU">
                <instance name="IRCOM">
                    <register-group address-space="data" offset="0x8F8" name-in-module="IRCOM" name="IRCOM"/>
                </instance>
            </module>
            <module name="FUSE" id="I6570" version="XMEGAA4U">
                <instance name="FUSE">
                    <register-group address-space="fuses" offset="0x00" name-in-module="NVM_FUSES" name="FUSE"/>
                </instance>
            </module>
            <module name="LOCKBIT" id="I6570" version="XMEGAA4U">
                <instance name="LOCKBIT">
                    <register-group address-space="lockbits" offset="0x00" name-in-module="NVM_LOCKBITS"
                                    name="LOCKBIT"/>
                </instance>
            </module>
