bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/XMEGA/ATXMEGA64A4U.xml
                <register caption="Input Channel Scan" name="SCAN" offset="0x06" size="1">
                    <bitfield caption="Positive MUX setting offset" mask="0xF0" name="OFFSET"/>
                    <bitfield caption="Number of Channels included in scan" mask="0x0F" name="SCANNUM"/>
                </register>
            </register-group>
            <register-group caption="Analog-to-Digital Converter" name="ADC" size="64">
                <register caption="Control Register A" name="CTRLA" offset="0x00" size="1">
                    <bitfield caption="DMA Selection" mask="0xC0" name="DMASEL" values="ADC_DMASEL"/>
                    <bitfield caption="Channel 3 Start Conversion" mask="0x20" name="CH3START"/>
                    <bitfield caption="Channel 2 Start Conversion" mask="0x10" name="CH2START"/>
                    <bitfield caption="Channel 1 Start Conversion" mask="0x08" name="CH1START"/>
                    <bitfield caption="Channel 0 Start Conversion" mask="0x04" name="CH0START"/>
                    <bitfield caption="Flush Pipeline" mask="0x02" name="FLUSH"/>
                    <bitfield caption="Enable ADC" mask="0x01" name="ENABLE"/>
                </register>
                <register caption="Control Register B" name="CTRLB" offset="0x01" size="1">
                    <bitfield caption="Gain Stage Impedance Mode" mask="0x80" name="IMPMODE"/>
                    <bitfield caption="Current Limitation" mask="0x60" name="CURRLIMIT" values="ADC_CURRLIMIT"/>
                    <bitfield caption="Conversion Mode" mask="0x10" name="CONMODE"/>
                    <bitfield caption="Free Running Mode Enable" mask="0x08" name="FREERUN"/>
                    <bitfield caption="Result Resolution" mask="0x06" name="RESOLUTION" values="ADC_RESOLUTION"/>
                </register>
                <register caption="Reference Control" name="REFCTRL" offset="0x02" size="1">
                    <bitfield caption="Reference Selection" mask="0x70" name="REFSEL" values="ADC_REFSEL"/>
                    <bitfield caption="Bandgap enable" mask="0x02" name="BANDGAP"/>
                    <bitfield caption="Temperature Reference Enable" mask="0x01" name="TEMPREF"/>
                </register>
                <register caption="Event Control" name="EVCTRL" offset="0x03" size="1">
                    <bitfield caption="Channel Sweep Selection" mask="0xC0" name="SWEEP" values="ADC_SWEEP"/>
                    <bitfield caption="Event Input Select" mask="0x38" name="EVSEL" values="ADC_EVSEL"/>
                    <bitfield caption="Event Action Select" mask="0x07" name="EVACT" values="ADC_EVACT"/>
                </register>
                <register caption="Clock Prescaler" name="PRESCALER" offset="0x04" size="1">
                    <bitfield caption="Clock Prescaler Selection" mask="0x07" name="PRESCALER" values="ADC_PRESCALER"/>
                </register>
                <register caption="Interrupt Flags" name="INTFLAGS" offset="0x06" size="1">
                    <bitfield caption="Channel 3 Interrupt Flag" mask="0x08" name="CH3IF"/>
                    <bitfield caption="Channel 2 Interrupt Flag" mask="0x04" name="CH2IF"/>
                    <bitfield caption="Channel 1 Interrupt Flag" mask="0x02" name="CH1IF"/>
                    <bitfield caption="Channel 0 Interrupt Flag" mask="0x01" name="CH0IF"/>
                </register>
                <register caption="Temporary Register" name="TEMP" offset="0x07" size="1"/>
                <register caption="Calibration Value" name="CAL" offset="0x0C" size="2"/>
                <register caption="Channel 0 Result" name="CH0RES" offset="0x10" size="2"/>
                <register caption="Channel 1 Result" name="CH1RES" offset="0x12" size="2"/>
                <register caption="Channel 2 Result" name="CH2RES" offset="0x14" size="2"/>
                <register caption="Channel 3 Result" name="CH3RES" offset="0x16" size="2"/>
                <register caption="Compare Value" name="CMP" offset="0x18" size="2"/>
                <register-group caption="ADC Channel 0" name="CH0" offset="0x20" name-in-module="ADC_CH"/>
                <register-group caption="ADC Channel 1" name="CH1" offset="0x28" name-in-module="ADC_CH"/>
                <register-group caption="ADC Channel 2" name="CH2" offset="0x30" name-in-module="ADC_CH"/>
                <register-group caption="ADC Channel 3" name="CH3" offset="0x38" name-in-module="ADC_CH"/>
            </register-group>
            <value-group caption="Positive input multiplexer selection" name="ADC_CH_MUXPOS">
                <value caption="Input pin 0" name="PIN0" value="0x00"/>
                <value caption="Input pin 1" name="PIN1" value="0x01"/>
                <value caption="Input pin 2" name="PIN2" value="0x02"/>
                <value caption="Input pin 3" name="PIN3" value="0x03"/>
                <value caption="Input pin 4" name="PIN4" value="0x04"/>
                <value caption="Input pin 5" name="PIN5" value="0x05"/>
                <value caption="Input pin 6" name="PIN6" value="0x06"/>
                <value caption="Input pin 7" name="PIN7" value="0x07"/>
                <value caption="Input pin 8" name="PIN8" value="0x08"/>
                <value caption="Input pin 9" name="PIN9" value="0x09"/>
                <value caption="Input pin 10" name="PIN10" value="0x0A"/>
                <value caption="Input pin 11" name="PIN11" value="0x0B"/>
                <value caption="Input pin 12" name="PIN12" value="0x0C"/>
                <value caption="Input pin 13" name="PIN13" value="0x0D"/>
                <value caption="Input pin 14" name="PIN14" value="0x0E"/>
                <value caption="Input pin 15" name="PIN15" value="0x0F"/>
            </value-group>
            <value-group caption="Internal input multiplexer selections" name="ADC_CH_MUXINT">
                <value caption="Temperature Reference" name="TEMP" value="0x00"/>
                <value caption="Bandgap Reference" name="BANDGAP" value="0x01"/>
                <value caption="1/10 scaled VCC" name="SCALEDVCC" value="0x02"/>
                <value caption="DAC output" name="DAC" value="0x03"/>
            </value-group>
            <value-group caption="Negative input multiplexer selection" name="ADC_CH_MUXNEG">
                <value caption="Input pin 0 (Input Mode = 2)" name="PIN0" value="0x00"/>
                <value caption="Input pin 1 (Input Mode = 2)" name="PIN1" value="0x01"/>
                <value caption="Input pin 2 (Input Mode = 2)" name="PIN2" value="0x02"/>
                <value caption="Input pin 3 (Input Mode = 2)" name="PIN3" value="0x03"/>
                <value caption="Input pin 4 (Input Mode = 3)" name="PIN4" value="0x00"/>
                <value caption="Input pin 5 (Input Mode = 3)" name="PIN5" value="0x01"/>
                <value caption="Input pin 6 (Input Mode = 3)" name="PIN6" value="0x02"/>
                <value caption="Input pin 7 (Input Mode = 3)" name="PIN7" value="0x03"/>
                <value caption="PAD Ground (Input Mode = 2)" name="GND_MODE3" value="0x05"/>
                <value caption="Internal Ground (Input Mode = 2)" name="INTGND_MODE3" value="0x07"/>
                <value caption="Internal Ground (Input Mode = 3)" name="INTGND_MODE4" value="0x04"/>
                <value caption="PAD Ground (Input Mode = 3)" name="GND_MODE4" value="0x07"/>
            </value-group>
            <value-group caption="Input mode" name="ADC_CH_INPUTMODE">
                <value caption="Internal inputs, no gain" name="INTERNAL" value="0x00"/>
                <value caption="Single-ended input, no gain" name="SINGLEENDED" value="0x01"/>
                <value caption="Differential input, no gain" name="DIFF" value="0x02"/>
                <value caption="Differential input, with gain" name="DIFFWGAIN" value="0x03"/>
            </value-group>
