bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/XMEGA/ATXMEGA64A4U.xml
            <value-group caption="Port Interrupt 1 Level" name="PORT_INT1LVL">
                <value caption="Interrupt Disabled" name="OFF" value="0x00"/>
                <value caption="Low Level" name="LO" value="0x01"/>
                <value caption="Medium Level" name="MED" value="0x02"/>
                <value caption="High Level" name="HI" value="0x03"/>
            </value-group>
            <value-group caption="Output/Pull Configuration" name="PORT_OPC">
                <value caption="Totempole" name="TOTEM" value="0x00"/>
                <value caption="Totempole w/ Bus keeper on Input and Output" name="BUSKEEPER" value="0x01"/>
                <value caption="Totempole w/ Pull-down on Input" name="PULLDOWN" value="0x02"/>
                <value caption="Totempole w/ Pull-up on Input" name="PULLUP" value="0x03"/>
                <value caption="Wired OR" name="WIREDOR" value="0x04"/>
                <value caption="Wired AND" name="WIREDAND" value="0x05"/>
                <value caption="Wired OR w/ Pull-down" name="WIREDORPULL" value="0x06"/>
                <value caption="Wired AND w/ Pull-up" name="WIREDANDPULL" value="0x07"/>
            </value-group>
            <value-group caption="Input/Sense Configuration" name="PORT_ISC">
                <value caption="Sense Both Edges" name="BOTHEDGES" value="0x00"/>
                <value caption="Sense Rising Edge" name="RISING" value="0x01"/>
                <value caption="Sense Falling Edge" name="FALLING" value="0x02"/>
                <value caption="Sense Level (Transparent For Events)" name="LEVEL" value="0x03"/>
                <value caption="Disable Digital Input Buffer" name="INPUT_DISABLE" value="0x07"/>
            </value-group>
            <interrupt-group name="PORT">
                <interrupt index="0" name="INT0" caption="External Interrupt 0"/>
                <interrupt index="1" name="INT1" caption="External Interrupt 1"/>
            </interrupt-group>
        </module>
        <module name="TC" id="I6090" version="XMEGAAU" caption="16-bit Timer/Counter With PWM">
            <register-group caption="16-bit Timer/Counter 0" name="TC0" size="64">
                <register caption="Control Register A" name="CTRLA" offset="0x00" size="1">
                    <bitfield caption="Clock Selection" mask="0x0F" name="CLKSEL" values="TC_CLKSEL"/>
                </register>
                <register caption="Control Register B" name="CTRLB" offset="0x01" size="1">
                    <bitfield caption="Compare or Capture D Enable" mask="0x80" name="CCDEN"/>
                    <bitfield caption="Compare or Capture C Enable" mask="0x40" name="CCCEN"/>
                    <bitfield caption="Compare or Capture B Enable" mask="0x20" name="CCBEN"/>
                    <bitfield caption="Compare or Capture A Enable" mask="0x10" name="CCAEN"/>
                    <bitfield caption="Waveform generation mode" mask="0x07" name="WGMODE" values="TC_WGMODE"/>
                </register>
                <register caption="Control register C" name="CTRLC" offset="0x02" size="1">
                    <bitfield caption="Compare D Output Value" mask="0x08" name="CMPD"/>
                    <bitfield caption="Compare C Output Value" mask="0x04" name="CMPC"/>
                    <bitfield caption="Compare B Output Value" mask="0x02" name="CMPB"/>
                    <bitfield caption="Compare A Output Value" mask="0x01" name="CMPA"/>
                </register>
                <register caption="Control Register D" name="CTRLD" offset="0x03" size="1">
                    <bitfield caption="Event Action" mask="0xE0" name="EVACT" values="TC_EVACT"/>
                    <bitfield caption="Event Delay" mask="0x10" name="EVDLY"/>
                    <bitfield caption="Event Source Select" mask="0x0F" name="EVSEL" values="TC_EVSEL"/>
                </register>
                <register caption="Control Register E" name="CTRLE" offset="0x04" size="1">
                    <bitfield caption="Byte Mode" mask="0x03" name="BYTEM" values="TC_BYTEM"/>
                </register>
                <register caption="Interrupt Control Register A" name="INTCTRLA" offset="0x06" size="1">
                    <bitfield caption="Error Interrupt Level" mask="0x0C" name="ERRINTLVL" values="TC_ERRINTLVL"/>
                    <bitfield caption="Overflow interrupt level" mask="0x03" name="OVFINTLVL" values="TC_OVFINTLVL"/>
                </register>
                <register caption="Interrupt Control Register B" name="INTCTRLB" offset="0x07" size="1">
                    <bitfield caption="Compare or Capture D Interrupt Level" mask="0xC0" name="CCDINTLVL"
                              values="TC_CCDINTLVL"/>
                    <bitfield caption="Compare or Capture C Interrupt Level" mask="0x30" name="CCCINTLVL"
                              values="TC_CCCINTLVL"/>
                    <bitfield caption="Compare or Capture B Interrupt Level" mask="0x0C" name="CCBINTLVL"
                              values="TC_CCBINTLVL"/>
                    <bitfield caption="Compare or Capture A Interrupt Level" mask="0x03" name="CCAINTLVL"
                              values="TC_CCAINTLVL"/>
                </register>
                <register caption="Control Register F Clear" name="CTRLFCLR" offset="0x08" size="1">
                    <bitfield caption="Command" mask="0x0C" name="CMD"/>
                    <bitfield caption="Lock Update" mask="0x02" name="LUPD"/>
                    <bitfield caption="Direction" mask="0x01" name="DIR"/>
                </register>
                <register caption="Control Register F Set" name="CTRLFSET" offset="0x09" size="1">
                    <bitfield caption="Command" mask="0x0C" name="CMD" values="TC_CMD"/>
                    <bitfield caption="Lock Update" mask="0x02" name="LUPD"/>
                    <bitfield caption="Direction" mask="0x01" name="DIR"/>
                </register>
                <register caption="Control Register G Clear" name="CTRLGCLR" offset="0x0A" size="1">
                    <bitfield caption="Compare or Capture D Buffer Valid" mask="0x10" name="CCDBV"/>
                    <bitfield caption="Compare or Capture C Buffer Valid" mask="0x08" name="CCCBV"/>
                    <bitfield caption="Compare or Capture B Buffer Valid" mask="0x04" name="CCBBV"/>
                    <bitfield caption="Compare or Capture A Buffer Valid" mask="0x02" name="CCABV"/>
                    <bitfield caption="Period Buffer Valid" mask="0x01" name="PERBV"/>
                </register>
                <register caption="Control Register G Set" name="CTRLGSET" offset="0x0B" size="1">
                    <bitfield caption="Compare or Capture D Buffer Valid" mask="0x10" name="CCDBV"/>
                    <bitfield caption="Compare or Capture C Buffer Valid" mask="0x08" name="CCCBV"/>
                    <bitfield caption="Compare or Capture B Buffer Valid" mask="0x04" name="CCBBV"/>
                    <bitfield caption="Compare or Capture A Buffer Valid" mask="0x02" name="CCABV"/>
                    <bitfield caption="Period Buffer Valid" mask="0x01" name="PERBV"/>
                </register>
